{"weightsManifest": [{"paths": ["group1-shard1of13", "group1-shard2of13", "group1-shard3of13", "group1-shard4of13", "group1-shard5of13", "group1-shard6of13", "group1-shard7of13", "group1-shard8of13", "group1-shard9of13", "group1-shard10of13", "group1-shard11of13", "group1-shard12of13", "group1-shard13of13"], "weights": [{"shape": [1], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack_1", "dtype": "int32"}, {"shape": [1], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack", "dtype": "int32"}, {"shape": [], "name": "FirstStageBoxPredictor/Reshape/shape/3", "dtype": "int32"}, {"shape": [], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/concat/axis", "dtype": "int32"}, {"shape": [], "name": "mul/y", "dtype": "int32"}, {"shape": [4], "name": "SecondStagePostprocessor/Reshape/shape", "dtype": "int32"}, {"shape": [4], "name": "SecondStageBoxPredictor/Reshape/shape", "dtype": "int32"}, {"shape": [12], "name": "SecondStageBoxPredictor/BoxEncodingPredictor/biases", "dtype": "float32"}, {"shape": [1024, 12], "name": "SecondStageBoxPredictor/BoxEncodingPredictor/weights", "dtype": "float32"}, {"shape": [], "name": "SecondStageBoxPredictor/Flatten_1/flatten/Reshape/shape/1", "dtype": "int32"}, {"shape": [2], "name": "SecondStageBoxPredictor/AvgPool_1/reduction_indices", "dtype": "int32"}, {"shape": [128], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 1024, 128], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 1024, 128], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [2], "name": "CropAndResize/CropAndResize/crop_size", "dtype": "int32"}, {"shape": [1], "name": "GridAnchorGenerator/Meshgrid_3/ExpandedShape_1/Slice_1/size", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/delta", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/ExpandDims/dim", "dtype": "int32"}, {"shape": [1], "name": "strided_slice_15/stack_1", "dtype": "int32"}, {"shape": [512], "name": "Conv/biases", "dtype": "float32"}, {"shape": [3, 3, 576, 512], "name": "Conv/weights", "dtype": "float32"}, {"shape": [], "name": "add_2/y", "dtype": "float32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/start", "dtype": "int32"}, {"shape": [], "name": "Preprocessor/mul/x", "dtype": "float32"}, {"shape": [1], "name": "strided_slice_14/stack_1", "dtype": "int32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 256, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [32], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 192, 32], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 64, 192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2b_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 64, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2b_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_1a_7x7/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 24, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_1a_7x7/separable_conv2d/merged_input", "dtype": "float32"}, {"shape": [7, 7, 3, 8], "name": "FirstStageFeatureExtractor/InceptionV2/Conv2d_1a_7x7/depthwise_weights", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 96, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 64, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 192, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 64, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 192, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 192, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 96, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 64, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 256, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 64, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 256, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 256, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 96, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_1a_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 64, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 320, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_0/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 128, 160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_0/Conv2d_1a_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 320, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4a/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 128, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 96, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 64, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 64], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [224], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 224], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 128, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 96, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 96, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 160, 160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 128, 160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 128, 160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 192, 192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 160, 192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 160], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 128, 192], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 128], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 96], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [48], "name": "FirstStageBoxPredictor/BoxEncodingPredictor/biases", "dtype": "float32"}, {"shape": [1, 1, 512, 48], "name": "FirstStageBoxPredictor/BoxEncodingPredictor/weights", "dtype": "float32"}, {"shape": [2], "name": "SecondStagePostprocessor/Decode/transpose/perm", "dtype": "int32"}, {"shape": [], "name": "ConstantFolding/SecondStagePostprocessor/Decode/truediv_2_recip", "dtype": "float32"}, {"shape": [2], "name": "SecondStagePostprocessor/Reshape_3/shape", "dtype": "int32"}, {"shape": [], "name": "GridAnchorGenerator/strided_slice_5", "dtype": "float32"}, {"shape": [2], "name": "GridAnchorGenerator/Reshape_2/shape", "dtype": "int32"}, {"shape": [], "name": "GridAnchorGenerator/strided_slice_4", "dtype": "float32"}, {"shape": [1, 1, 12], "name": "GridAnchorGenerator/Meshgrid_2/Reshape", "dtype": "float32"}, {"shape": [1, 1, 12], "name": "GridAnchorGenerator/Meshgrid_3/Reshape", "dtype": "float32"}, {"shape": [], "name": "GridAnchorGenerator/mul_5/x", "dtype": "float32"}, {"shape": [3], "name": "GridAnchorGenerator/Meshgrid_3/ExpandedShape/concat", "dtype": "int32"}, {"shape": [], "name": "ConstantFolding/SecondStagePostprocessor/Decode/truediv_recip", "dtype": "float32"}, {"shape": [2], "name": "SecondStagePostprocessor/strided_slice_1/stack_2", "dtype": "int32"}, {"shape": [2], "name": "SecondStagePostprocessor/strided_slice_2/stack_1", "dtype": "int32"}, {"shape": [2], "name": "SecondStagePostprocessor/strided_slice_1/stack_1", "dtype": "int32"}, {"shape": [2], "name": "SecondStagePostprocessor/strided_slice_1/stack", "dtype": "int32"}, {"shape": [3], "name": "strided_slice_10/stack_2", "dtype": "int32"}, {"shape": [3], "name": "strided_slice_10/stack_1", "dtype": "int32"}, {"shape": [3], "name": "SecondStagePostprocessor/Slice/begin", "dtype": "int32"}, {"shape": [24], "name": "FirstStageBoxPredictor/ClassPredictor/biases", "dtype": "float32"}, {"shape": [1, 1, 512, 24], "name": "FirstStageBoxPredictor/ClassPredictor/weights", "dtype": "float32"}, {"shape": [256], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 256, 256], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_1a_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [256], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 192, 256], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_0/Conv2d_1a_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 128, 192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_0/Conv2d_1a_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [128], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 576, 128], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [224], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 224, 224], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [224], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 160, 224], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [160], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 1024, 160], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [320], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 192, 320], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 1024, 192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [352], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 1024, 352], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [224], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 224, 224], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [224], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 192, 224], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 1024, 192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [320], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [3, 3, 192, 320], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input", "dtype": "float32"}, {"shape": [192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 1024, 192], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [352], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset", "dtype": "float32"}, {"shape": [1, 1, 1024, 352], "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input", "dtype": "float32"}, {"shape": [4], "name": "SecondStagePostprocessor/Tile/multiples", "dtype": "int32"}, {"shape": [3], "name": "SecondStagePostprocessor/Slice/size", "dtype": "int32"}, {"shape": [3], "name": "SecondStagePostprocessor/Reshape_1/shape", "dtype": "int32"}, {"shape": [3], "name": "SecondStageBoxPredictor/Reshape_1/shape", "dtype": "int32"}, {"shape": [4], "name": "SecondStageBoxPredictor/ClassPredictor/biases", "dtype": "float32"}, {"shape": [1024, 4], "name": "SecondStageBoxPredictor/ClassPredictor/weights", "dtype": "float32"}, {"shape": [], "name": "Preprocessor/map/while/add/y", "dtype": "int32"}, {"shape": [1], "name": "Preprocessor/map/while/ResizeToRange/strided_slice/stack_1", "dtype": "int32"}, {"shape": [1], "name": "Preprocessor/map/while/ResizeToRange/strided_slice_1/stack_1", "dtype": "int32"}, {"shape": [1], "name": "Preprocessor/map/while/ResizeToRange/strided_slice/stack", "dtype": "int32"}, {"shape": [], "name": "Preprocessor/map/while/ResizeToRange/cond/resize/ExpandDims/dim", "dtype": "int32"}, {"shape": [], "name": "Preprocessor/map/while/ResizeToRange/cond/resize/ToFloat_2", "dtype": "float32"}, {"shape": [], "name": "Preprocessor/map/while/ResizeToRange/cond/resize/ToFloat", "dtype": "float32"}, {"shape": [], "name": "Preprocessor/map/while/ResizeToRange/cond/resize_1/ExpandDims/dim", "dtype": "int32"}, {"shape": [], "name": "Preprocessor/map/while/ResizeToRange/cond/resize_1/ToFloat_2", "dtype": "float32"}, {"shape": [], "name": "Preprocessor/map/while/ResizeToRange/cond/resize_1/ToFloat", "dtype": "float32"}, {"shape": [], "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/concat/axis", "dtype": "int32"}, {"shape": [], "name": "ConstantFolding/BatchMultiClassNonMaxSuppression/ones/packed_const_axis", "dtype": "int32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/range_1/delta", "dtype": "int32"}, {"shape": [1], "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/strided_slice_2/stack_1", "dtype": "int32"}, {"shape": [1], "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/strided_slice_1/stack_1", "dtype": "int32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Select/e", "dtype": "int32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_3/x", "dtype": "int32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Greater/y", "dtype": "int32"}, {"shape": [1], "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/strided_slice_2/stack", "dtype": "int32"}, {"shape": [1], "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ones_1/Reshape/shape", "dtype": "int32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/GreaterEqual/y", "dtype": "float32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/non_max_suppression/iou_threshold", "dtype": "float32"}, {"shape": [3], "name": "BatchMultiClassNonMaxSuppression/map/while/Reshape/shape", "dtype": "int32"}, {"shape": [3], "name": "BatchMultiClassNonMaxSuppression/map/while/Slice/begin", "dtype": "int32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_2/x", "dtype": "int32"}, {"shape": [2], "name": "BatchMultiClassNonMaxSuppression/map/while/Reshape_1/shape", "dtype": "int32"}, {"shape": [2], "name": "BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/zeros_1", "dtype": "int32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ones_1/Const", "dtype": "float32"}, {"shape": [], "name": "BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/mul_1/x", "dtype": "float32"}, {"shape": [], "name": "map/while/ToNormalizedCoordinates/Scale/split/split_dim", "dtype": "int32"}, {"shape": [1], "name": "map/while/strided_slice/stack_1", "dtype": "int32"}, {"shape": [1], "name": "map/while/strided_slice_1/stack_1", "dtype": "int32"}, {"shape": [], "name": "map/while/ToNormalizedCoordinates/truediv/x", "dtype": "float32"}, {"shape": [1], "name": "map/while/strided_slice/stack", "dtype": "int32"}, {"shape": [], "name": "map_2/while/split/split_dim", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/range_3/delta", "dtype": "int32"}, {"shape": [1], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/strided_slice_2/stack_1", "dtype": "int32"}, {"shape": [1], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/strided_slice_2/stack", "dtype": "int32"}, {"shape": [1], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/strided_slice_1/stack_1", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Greater/y", "dtype": "int32"}, {"shape": [1], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ones_3/Reshape/shape", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/add_1/y", "dtype": "float32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/non_max_suppression/iou_threshold", "dtype": "float32"}, {"shape": [3], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/Reshape/shape", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Select/e", "dtype": "int32"}, {"shape": [3], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/Slice/begin", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Minimum/x", "dtype": "int32"}, {"shape": [2], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/Reshape_1/shape", "dtype": "int32"}, {"shape": [2], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/zeros_1", "dtype": "int32"}, {"shape": [2], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Slice_2/begin", "dtype": "int32"}, {"shape": [2], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/Slice_1/begin", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/add_3/y", "dtype": "float32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/mul_3/x", "dtype": "float32"}, {"shape": [1], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ChangeCoordinateFrame/strided_slice_2/stack_1", "dtype": "int32"}, {"shape": [1], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/ChangeCoordinateFrame/strided_slice/stack_1", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_2/x", "dtype": "int32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/MultiClassNonMaxSuppression/add_5/y", "dtype": "float32"}, {"shape": [], "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/sub_3/x", "dtype": "int32"}, {"shape": [], "name": "ConstantFolding/SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Slice_2/size_const_axis", "dtype": "int32"}, {"shape": [], "name": "ConstantFolding/SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/Slice_3/size_const_axis", "dtype": "int32"}, {"shape": [], "name": "ConstantFolding/SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/stack_2/values_1_const_axis", "dtype": "int32"}, {"shape": [], "name": "ConstantFolding/SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/while/PadOrClipBoxList/stack_3/values_1_const_axis", "dtype": "int32"}]}], "modelTopology": {"node": [{"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayUnstack_1/strided_slice/stack"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "FirstStageBoxPredictor/Reshape/shape/3"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5a/concat/axis"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "mul/y"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStagePostprocessor/Reshape/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStageBoxPredictor/Reshape/shape"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "12"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "SecondStageBoxPredictor/BoxEncodingPredictor/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1024"}, {"size": "12"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "SecondStageBoxPredictor/BoxEncodingPredictor/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStageBoxPredictor/Flatten_1/flatten/Reshape/shape/1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStageBoxPredictor/AvgPool_1/reduction_indices"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5c/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "SecondStageFeatureExtractor/InceptionV2/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "CropAndResize/CropAndResize/crop_size"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "GridAnchorGenerator/Meshgrid_3/ExpandedShape_1/Slice_1/size"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/delta"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStagePostprocessor/ExpandDims/dim"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "strided_slice_15/stack_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "Conv/biases"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "512"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "Conv/weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "add_2/y"}, {"op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_UINT8"}}, "name": "image_tensor"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "SecondStagePostprocessor/BatchMultiClassNonMaxSuppression/map/TensorArrayStack/range/start"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "Preprocessor/mul/x"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "name": "strided_slice_14/stack_1"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4e/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4d/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4c/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_4b/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_3/Conv2d_0b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_3/Conv2d_0b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "192"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2c_3x3/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "192"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2c_3x3/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2b_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_2b_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_1a_7x7/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Conv2d_1a_7x7/separable_conv2d/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "8"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/Conv2d_1a_7x7/depthwise_weights"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0b_3x3/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_2/Conv2d_0a_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0b_3x3/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0b_3x3/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_1/Conv2d_0a_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_0/Conv2d_0a_1x1/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3b/Branch_0/Conv2d_0a_1x1/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0c_3x3/BatchNorm/FusedBatchNorm/Offset"}, {"op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "name": "FirstStageFeatureExtractor/InceptionV2/InceptionV2/Mixed_3c/Branch_2/Conv2d_0c_3x3/Conv2D/merged_input"}, {"op": "Const", "attr": {"value": {"tensor": 